Revit 2027 API
Control.Shape Property
 The control shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ControlShape Shape { get; }
Public ReadOnly Property Shape As ControlShape
	Get
public:
property ControlShape Shape {
	ControlShape get ();
}
member Shape : ControlShape with get
Property Value
ControlShape
See Also
Reference
Control Class
Autodesk.Revit.DB Namespace